meeting/agenda/2026/07-21.org
:PROPERTIES:
:ID:       ED09A135-B2FD-4416-984C-6BC29E257C4E
:END:
#+title: QT4 CG Meeting 173 Agenda 2026-07-21
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:ID:       32695465-14B5-4BE2-AA87-B718006EE5B9
:END:

This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT).

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for more details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:ID:       6E5B9B29-8E2A-4EB4-81EE-FD569E74ACA6
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:ID:       D73E4586-EBCD-4523-A100-164BA644C400
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:ID:       02777C9E-B29D-41DA-AACC-3A42EF9E8EF3
:END:

** Approve minutes of previous meetings
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:ID:       3BE40645-04B8-439E-A9DE-D4D58191E3AE
:END:

Minutes of [[../../minutes/2026/07-07.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:ID:       C6A2200A-5B5F-4B36-903D-35ED5280CAEE
:END:

This meeting is planned for 21 July 2026.

The next meeting is planned for 28 July. There will be no meeting on 4 August.

** Review of open action items [0/10]
:PROPERTIES:
:CUSTOM_ID: open-actions
:ID:       AD7E58EB-760F-427C-93D2-A6F2ADF2D7AA
:END:

+ [ ] QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests
+ [ ] QT4CG-167-02: MK to make a PR for #2591, grammar for step?lookup is invalid
+ [ ] QT4CG-167-03: NW to make a PR for #2482, fallback on bin:decode-string
+ [ ] QT4CG-167-05: MK to write a proposal to change #2393 so the functions return JNodes
+ [ ] QT4CG-167-07: NW to review tests for interpolated strings with edge cases in mind
+ [ ] QT4CG-167-08: MK to review the state of #1949 to see which items are still outstanding.
+ [ ] QT4CG-167-09: NW to close all “nice to have” issues at the end of October if they haven’t progressed
+ [ ] QT4CG-170-01: RD to draft a proposal that attempts to address the lexical issues differently.
+ [ ] QT4CG-172-01: MK to check if the XSLT rules are consistent with the rules in #2757.

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:ID:       2D8031C4-8726-4A0C-A0C9-C7247BF7E9D5
:END:

This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See [[#technical-agenda][Technical Agenda]] below for the focus of this
meeting.

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:ID:       76077E92-4DFA-4FCA-912C-EA8ACF97F934
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-2071][#2071]]: 77c deep update
+ PR [[https://qt4cg.org/dashboard/#pr-2160][#2160]]: 2073 data model changes for JNodes and Sequences
+ PR [[https://qt4cg.org/dashboard/#pr-2247][#2247]]: 716 Deferred Evaluation in XPath - the f:generator record
+ PR [[https://qt4cg.org/dashboard/#pr-2350][#2350]]: 708 An alternative proposal for generators
+ PR [[https://qt4cg.org/dashboard/#pr-2768][#2768]]: 2740 Drop constructor functions from built-in records

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:ID:       F8D0551B-1322-47CD-8B0B-A937FAE4A111
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-2594][#2594]]: 2389 Adaptive Serialization: more freedom
+ PR [[https://qt4cg.org/dashboard/#pr-2696][#2696]]: 2695 Apply templates to maps, arrays, and JNodes
+ PR [[https://qt4cg.org/dashboard/#pr-2707][#2707]]: 1962 fn:map-to-element
+ PR [[https://qt4cg.org/dashboard/#pr-2712][#2712]]: 2702 Dynamic node tests
+ PR [[https://qt4cg.org/dashboard/#pr-2714][#2714]]: 2219 Generalize method calls to sequences
+ PR [[https://qt4cg.org/dashboard/#pr-2715][#2715]]: 2653 FLWOR, member/key/value clauses: allow sequences
+ PR [[https://qt4cg.org/dashboard/#pr-2719][#2719]]: 1234 Serialization Parameters: Indentation, Whitespace, Newlines
+ PR [[https://qt4cg.org/dashboard/#pr-2734][#2734]]: 2733 A step too far
+ PR [[https://qt4cg.org/dashboard/#pr-2739][#2739]]: 2738 XSLT - tree terminology
+ PR [[https://qt4cg.org/dashboard/#pr-2760][#2760]]: 2521 URIs: unify handling of fragment identifiers
+ PR [[https://qt4cg.org/dashboard/#pr-2777][#2777]]: 2644 Extend casts to sequences, arrays, maps, and records
+ PR [[https://qt4cg.org/dashboard/#pr-2788][#2788]]: 2774 Reversion of PR 2747 which allowed `A/B?C`
+ PR [[https://qt4cg.org/dashboard/#pr-2789][#2789]]: 2787 XQuery changes to merge declare record and declare type
+ PR [[https://qt4cg.org/dashboard/#pr-2792][#2792]]: 2790 fn:pad-string, truncation
+ PR [[https://qt4cg.org/dashboard/#pr-2793][#2793]]: 2729 fn:replace: named groups (+other regex functions)
+ PR [[https://qt4cg.org/dashboard/#pr-2794][#2794]]: 2748 CSV Serialization
+ PR [[https://qt4cg.org/dashboard/#pr-2795][#2795]]: 2338 Nomenclature: node(), gnode(), xnode()
+ PR [[https://qt4cg.org/dashboard/#pr-2796][#2796]]: 2352 Trusted execution: clarifications
+ PR [[https://qt4cg.org/dashboard/#pr-2797][#2797]]: 2699 fn:element-to-map: validation
+ PR [[https://qt4cg.org/dashboard/#pr-2800][#2800]]: 2799 fn:slice: negative steps

*** Required for V4.0
:PROPERTIES:
:CUSTOM_ID: required-40
:ID:       4946E5DF-8F58-464D-A10A-5A921006E84C
:END:

The following issues are labeled “required for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1777][#1777]]: Shallow copy in XSLT with maps and arrays
+ Issue [[https://github.com/qt4cg/qtspecs/issues/675][#675]]: XSLT streaming rules for new constructs

