meeting/agenda/2026/07-21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 173 Agenda 2026-07-21</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 173 Agenda 2026-07-21</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>
<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT).
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for more details.
</p>
</div>
</div>
<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>
<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>
<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>
<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meetings</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2026/07-07.html">the previous meeting</a>.
</p>
</div>
</div>
<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 21 July 2026.
</p>

<p>
The next meeting is planned for 28 July. There will be no meeting on 4 August.
</p>
</div>
</div>
<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[0/10]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-02: MK to make a PR for #2591, grammar for step?lookup is invalid</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-03: NW to make a PR for #2482, fallback on bin:decode-string</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-05: MK to write a proposal to change #2393 so the functions return JNodes</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-07: NW to review tests for interpolated strings with edge cases in mind</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-08: MK to review the state of #1949 to see which items are still outstanding.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-167-09: NW to close all “nice to have” issues at the end of October if they haven’t progressed</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-170-01: RD to draft a proposal that attempts to address the lexical issues differently.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-172-01: MK to check if the XSLT rules are consistent with the rules in #2757.</li>
</ul>
</div>
</div>
<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>
<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2071">#2071</a>: 77c deep update</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2160">#2160</a>: 2073 data model changes for JNodes and Sequences</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2247">#2247</a>: 716 Deferred Evaluation in XPath - the f:generator record</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2350">#2350</a>: 708 An alternative proposal for generators</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2768">#2768</a>: 2740 Drop constructor functions from built-in records</li>
</ul>
</div>
</div>
<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.2.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2594">#2594</a>: 2389 Adaptive Serialization: more freedom</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2696">#2696</a>: 2695 Apply templates to maps, arrays, and JNodes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2707">#2707</a>: 1962 fn:map-to-element</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2712">#2712</a>: 2702 Dynamic node tests</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2714">#2714</a>: 2219 Generalize method calls to sequences</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2715">#2715</a>: 2653 FLWOR, member/key/value clauses: allow sequences</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2719">#2719</a>: 1234 Serialization Parameters: Indentation, Whitespace, Newlines</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2734">#2734</a>: 2733 A step too far</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2739">#2739</a>: 2738 XSLT - tree terminology</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2760">#2760</a>: 2521 URIs: unify handling of fragment identifiers</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2777">#2777</a>: 2644 Extend casts to sequences, arrays, maps, and records</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2788">#2788</a>: 2774 Reversion of PR 2747 which allowed `A/B?C`</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2789">#2789</a>: 2787 XQuery changes to merge declare record and declare type</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2792">#2792</a>: 2790 fn:pad-string, truncation</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2793">#2793</a>: 2729 fn:replace: named groups (+other regex functions)</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2794">#2794</a>: 2748 CSV Serialization</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2795">#2795</a>: 2338 Nomenclature: node(), gnode(), xnode()</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2796">#2796</a>: 2352 Trusted execution: clarifications</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2797">#2797</a>: 2699 fn:element-to-map: validation</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2800">#2800</a>: 2799 fn:slice: negative steps</li>
</ul>
</div>
</div>
<div id="outline-container-required-40" class="outline-4">
<h4 id="required-40"><span class="section-number-4">1.6.3.</span> Required for V4.0</h4>
<div class="outline-text-4" id="text-required-40">
<p>
The following issues are labeled “required for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1777">#1777</a>: Shallow copy in XSLT with maps and arrays</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/675">#675</a>: XSLT streaming rules for new constructs</li>
</ul>
</div>
</div>
</div>
</div>
