meeting/agenda/2026/07-21.org
* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:ID:       1DADB821-F041-4D37-A014-02B6FC0A639C
:END:

This week, I’ve put the oldest ones first, but we might decide to skip over some of them.

** PR #2594: 2389 Adaptive Serialization: more freedom
:PROPERTIES:
:CUSTOM_ID: Technical_agenda-PR_#2594:_2389_Adaptive_Serialization:_more_freedom-B82DDEC3
:ID:       47F64278-FC16-4795-97F4-126DCC0D7649
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2594][#2594]].
** PR #2696: 2695 Apply templates to maps, arrays, and JNodes
:PROPERTIES:
:CUSTOM_ID: Technical_agenda-PR_#2696:_2695_Apply_templates_to_maps,_arrays,_and_JNodes-EFA11EDD
:ID:       592D4549-0A0C-4206-8443-1C688CD54287
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2696][#2696]].
** PR #2707: 1962 fn:map-to-element
:PROPERTIES:
:CUSTOM_ID: Technical_agenda-PR_#2707:_1962_fn:map-to-element-E69118A2
:ID:       59AEF873-024B-44AD-8823-2F9A79280986
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2707][#2707]].
** PR #2712: 2702 Dynamic node tests
:PROPERTIES:
:CUSTOM_ID: Technical_agenda-PR_#2712:_2702_Dynamic_node_tests-07154989
:ID:       F462976F-E77C-483A-9246-68573E0A7F6A
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2712][#2712]].
** PR #2714: 2219 Generalize method calls to sequences
:PROPERTIES:
:CUSTOM_ID: Technical_agenda-PR_#2714:_2219_Generalize_method_calls_to_sequences-6BD9D433
:ID:       DBB3DA54-9E65-4814-B8D5-19B245BF6DA6
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2714][#2714]].
** PR #2715: 2653 FLWOR, member/key/value clauses: allow sequences
:PROPERTIES:
:CUSTOM_ID: Technical_agenda-PR_#2715:_2653_FLWOR,_memberkeyvalue_clauses:_allow_sequences-2FAE0374
:ID:       4B2F9A35-908E-4996-82B2-0EF56BD62391
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2715][#2715]].
** PR #2719: 1234 Serialization Parameters: Indentation, Whitespace, Newlines
:PROPERTIES:
:CUSTOM_ID: Technical_agenda-PR_#2719:_1234_Serialization_Parameters:_Indentation,_Whitespace,_Newlines-E76B440D
:ID:       558E84A5-7EF0-4CFE-97EB-74BB81D6EC15
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2719][#2719]].
** PR #2734: 2733 A step too far
:PROPERTIES:
:CUSTOM_ID: Technical_agenda-PR_#2734:_2733_A_step_too_far-0EE10B98
:ID:       C3BD99A0-20A4-4928-B672-670ED9F7B913
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2734][#2734]].
** PR #2739: 2738 XSLT - tree terminology
:PROPERTIES:
:CUSTOM_ID: Technical_agenda-PR_#2739:_2738_XSLT_-_tree_terminology-680E7639
:ID:       E73C0258-D12F-4491-BD66-55FB884DB93E
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2739][#2739]].
** PR #2760: 2521 URIs: unify handling of fragment identifiers
:PROPERTIES:
:CUSTOM_ID: Technical_agenda-PR_#2760:_2521_URIs:_unify_handling_of_fragment_identifiers-C4373B4C
:ID:       80968178-8844-4142-9578-C4853D54AC4D
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2760][#2760]].
** PR #2777: 2644 Extend casts to sequences, arrays, maps, and records
:PROPERTIES:
:CUSTOM_ID: Technical_agenda-PR_#2777:_2644_Extend_casts_to_sequences,_arrays,_maps,_and_records-F07DF2BB
:ID:       880FBEF9-3A84-4432-B668-60D06A75120E
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2777][#2777]].
** PR #2788: 2774 Reversion of PR 2747 which allowed `A/B?C`
:PROPERTIES:
:CUSTOM_ID: Technical_agenda-PR_#2788:_2774_Reversion_of_PR_2747_which_allowed_`AB?C`-459BAA3E
:ID:       0843FDB4-0936-4FA7-B651-7E5A990742EE
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2788][#2788]].
** PR #2789: 2787 XQuery changes to merge declare record and declare type
:PROPERTIES:
:CUSTOM_ID: Technical_agenda-PR_#2789:_2787_XQuery_changes_to_merge_declare_record_and_declare_type-F4A317C7
:ID:       70944BDA-D95E-4161-91CD-AC9749A136C4
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2789][#2789]].
** PR #2792: 2790 fn:pad-string, truncation
:PROPERTIES:
:CUSTOM_ID: Technical_agenda-PR_#2792:_2790_fn:pad-string,_truncation-7BAA2D56
:ID:       8DF7A094-443C-4D67-B0B6-9F6198B663B6
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2792][#2792]].
** PR #2793: 2729 fn:replace: named groups (+other regex functions)
:PROPERTIES:
:CUSTOM_ID: Technical_agenda-PR_#2793:_2729_fn:replace:_named_groups_(+other_regex_functions)-F7EEBE57
:ID:       840D17C7-6C21-4971-8A1D-CDF846EAA47A
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2793][#2793]].
** PR #2794: 2748 CSV Serialization
:PROPERTIES:
:CUSTOM_ID: Technical_agenda-PR_#2794:_2748_CSV_Serialization-AAA040D4
:ID:       8D0A7DE0-197E-4BE8-AD9A-72D2494DEB98
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2794][#2794]].
** PR #2795: 2338 Nomenclature: node(), gnode(), xnode()
:PROPERTIES:
:CUSTOM_ID: Technical_agenda-PR_#2795:_2338_Nomenclature:_node(),_gnode(),_xnode()-2A49B607
:ID:       82A60D98-4739-49D5-BC91-259D0AB6B60C
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2795][#2795]].
** PR #2796: 2352 Trusted execution: clarifications
:PROPERTIES:
:CUSTOM_ID: Technical_agenda-PR_#2796:_2352_Trusted_execution:_clarifications-50C9573A
:ID:       422E9CC0-7083-4855-B218-8F4275EC4B12
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2796][#2796]].
** PR #2797: 2699 fn:element-to-map: validation
:PROPERTIES:
:CUSTOM_ID: Technical_agenda-PR_#2797:_2699_fn:element-to-map:_validation-60EFCAA5
:ID:       354FFD67-CB5E-49FB-AB3C-881C323B339C
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2797][#2797]].
** PR #2800: 2799 fn:slice: negative steps
:PROPERTIES:
:CUSTOM_ID: Technical_agenda-PR_#2800:_2799_fn:slice:_negative_steps-15FB69E7
:ID:       D6180082-B8A9-4047-9931-C7A01E3DE595
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2800][#2800]].


