meeting/agenda/2026/07-21.html
<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
<p>
This week, I’ve put the oldest ones first, but we might decide to skip over some of them.
</p>
</div>
